; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-3-2-3-8) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 distributor0)
	(clear crate7)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at truck2 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 depot0)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(at crate1 distributor0)
	(on crate1 crate0)
	(at crate2 depot0)
	(on crate2 pallet0)
	(at crate3 distributor0)
	(on crate3 crate1)
	(at crate4 depot0)
	(on crate4 crate2)
	(at crate5 distributor0)
	(on crate5 crate3)
	(at crate6 depot0)
	(on crate6 crate4)
	(at crate7 distributor0)
	(on crate7 crate5)
)

(:goal (and
		(on crate1 crate7)
		(on crate2 crate5)
		(on crate4 pallet0)
		(on crate5 crate6)
		(on crate6 crate4)
		(on crate7 pallet1)
	)
))

; plan
1. (lift hoist1 crate7 crate5 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate5) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate5)
   goals met: 1 of 6
2. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 1 of 6
3. (lift hoist1 crate5 crate3 distributor0)
   deleted: (at crate5 distributor0) (available hoist1) (on crate5 crate3) (clear crate5)
   added: (lifting hoist1 crate5) (clear crate3)
   goals met: 1 of 6
4. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 1 of 6
5. (lift hoist1 crate3 crate1 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 crate1) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate1)
   goals met: 1 of 6
6. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 1 of 6
7. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (available hoist1) (on crate1 crate0) (clear crate1)
   added: (lifting hoist1 crate1) (clear crate0)
   goals met: 1 of 6
8. (load hoist1 crate1 truck2 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck2) (available hoist1)
   goals met: 1 of 6
9. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (available hoist1) (on crate0 pallet1) (clear crate0)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 1 of 6
10. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 1 of 6
11. (unload hoist1 crate7 truck0 distributor0)
   deleted: (available hoist1) (in crate7 truck0)
   added: (lifting hoist1 crate7)
   goals met: 1 of 6
12. (lift hoist0 crate6 crate4 depot0)
   deleted: (at crate6 depot0) (available hoist0) (on crate6 crate4) (clear crate6)
   added: (lifting hoist0 crate6) (clear crate4)
   goals met: 0 of 6
13. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 0 of 6
14. (lift hoist0 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 crate2) (clear crate4)
   added: (lifting hoist0 crate4) (clear crate2)
   goals met: 0 of 6
15. (lift hoist2 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (available hoist2) (on crate2 pallet0) (clear crate2)
   added: (lifting hoist2 crate2) (clear pallet0)
   goals met: 0 of 6
16. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (at crate7 distributor0) (available hoist1) (on crate7 pallet1) (clear crate7)
   goals met: 1 of 6
17. (drop hoist0 crate4 pallet0 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet0)
   added: (at crate4 depot0) (available hoist0) (on crate4 pallet0) (clear crate4)
   goals met: 2 of 6
18. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 6
19. (unload hoist0 crate6 truck1 depot0)
   deleted: (available hoist0) (in crate6 truck1)
   added: (lifting hoist0 crate6)
   goals met: 2 of 6
20. (drop hoist0 crate6 crate4 depot0)
   deleted: (lifting hoist0 crate6) (clear crate4)
   added: (at crate6 depot0) (available hoist0) (on crate6 crate4) (clear crate6)
   goals met: 3 of 6
21. (unload hoist0 crate5 truck0 depot0)
   deleted: (available hoist0) (in crate5 truck0)
   added: (lifting hoist0 crate5)
   goals met: 3 of 6
22. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (at crate5 depot0) (available hoist0) (on crate5 crate6) (clear crate5)
   goals met: 4 of 6
23. (drop hoist2 crate2 crate5 depot0)
   deleted: (lifting hoist2 crate2) (clear crate5)
   added: (at crate2 depot0) (available hoist2) (on crate2 crate5) (clear crate2)
   goals met: 5 of 6
24. (unload hoist1 crate1 truck2 distributor0)
   deleted: (available hoist1) (in crate1 truck2)
   added: (lifting hoist1 crate1)
   goals met: 5 of 6
25. (drop hoist1 crate1 crate7 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate7)
   added: (at crate1 distributor0) (available hoist1) (on crate1 crate7) (clear crate1)
   goals met: 6 of 6
